app/views/turns/_form.html.erb

    <%= form.label :sucursal_id %>
    <%= form.collection_select :sucursal_id, Sucursal.all.order(nombre: :asc), :id, :nombre %>
---
SELECT `sucursals`.* FROM `sucursals` ORDER BY `sucursals`.`nombre` ASC