app/views/turns/_form.html.erb

SELECT `sucursals`.* FROM `sucursals` WHERE `sucursals`.`borrado` = 'N' ORDER BY `sucursals`.`nombre` ASC
---
    <%= form.label :sucursal_id %>
    <%= form.collection_select :sucursal_id, Sucursal.where(borrado: "N").order(nombre: :asc), :id, :nombre %>