app/controllers/authentication/sessions_controller.rb

	def create
	  @user = User.find_by("email = :login", { login: params[:login] })
---
SELECT `users`.* FROM `users` WHERE (email = 'ale@mail.com') LIMIT 1