app/controllers/authentication/users_controller.rb

INSERT INTO `users` (`email`, `password_digest`, `rol`, `created_at`, `updated_at`) VALUES ('ale@gmail.com', '$2a$12$kDTw.A7xEBLWVqYzUbIe8.96t7pMD7SuU34dzxaP6BC4ReSz5EfbG', 'Cliente', '2022-12-04 20:33:59.891598', '2022-12-04 20:33:59.891598')
---
    def create
        @user = User.new(user_params)

        if @user.save