app/controllers/sucursals_controller.rb

UPDATE `sucursals` SET `sucursals`.`borrado` = 'S', `sucursals`.`updated_at` = '2022-12-08 17:46:29.123849' WHERE `sucursals`.`id` = 1
---
  def destroy
      sucursal.update(:borrado => "S")