app/controllers/sucursals_controller.rb

  def index
    @sucursals = Sucursal.all
---
SELECT `sucursals`.* FROM `sucursals`

  def create
    @sucursal = Sucursal.new({
      :nombre => sucursal_params["nombre"], :direccion => sucursal_params["direccion"], :telefono => sucursal_params["telefono"]
      })
      if @sucursal.save
        create_horario @sucursal
        redirect_to sucursals_url, notice: t('.created')
---
INSERT INTO `sucursals` (`nombre`, `direccion`, `telefono`, `created_at`, `updated_at`) VALUES ('La Lomqq', '42 e/ 21 y 22', '22145678995', '2022-12-05 23:12:19.312346', '2022-12-05 23:12:19.312346')
INSERT INTO `sucursals` (`nombre`, `direccion`, `telefono`, `created_at`, `updated_at`) VALUES ('La Loma1', '42 e/ 21 y 22', '22145678995', '2022-12-05 22:09:19.316454', '2022-12-05 22:09:19.316454')

  def update
    if sucursal.update(:nombre => sucursal_params["nombre"], :direccion => sucursal_params["direccion"], :telefono => sucursal_params["telefono"])
      redirect_to sucursals_url, notice: t(".updated")
---
UPDATE `sucursals` SET `sucursals`.`telefono` = '123444451aaa', `sucursals`.`updated_at` = '2022-12-05 23:12:09.114832' WHERE `sucursals`.`id` = 7
UPDATE `sucursals` SET `sucursals`.`telefono` = '2214567899533', `sucursals`.`updated_at` = '2022-12-05 22:15:56.709199' WHERE `sucursals`.`id` = 1

  def destroy
      begin
        sucursal.destroy
      rescue
        redirect_to sucursals_url, alert: t(".not_destroyed")
      else
      redirect_to sucursals_url, notice: t(".destroyed")
---
DELETE FROM `sucursals` WHERE `sucursals`.`id` = 7
DELETE FROM `sucursals` WHERE `sucursals`.`id` = 1

    def sucursal
      @sucursal = Sucursal.find(params[:id])
---
SELECT `sucursals`.* FROM `sucursals` WHERE `sucursals`.`id` = 7 LIMIT 1