app/controllers/turns_controller.rb

SELECT `turns`.* FROM `turns` WHERE `turns`.`user_id` = 1 ORDER BY `turns`.`created_at` DESC
---
    def index
        @turns = Turn.where(user_id: Current.user.id).order(created_at: :desc)

INSERT INTO `turns` (`fecha`, `hora`, `estado`, `motivo`, `created_at`, `updated_at`, `user_id`, `sucursal_id`) VALUES ('2022-12-29', '14:26:00', 'Pendiente', 'r', '2022-12-08 17:25:13.765540', '2022-12-08 17:25:13.765540', 1, 1)
---
    def create
        @turn = Current.user.turns.new(turn_params)
        if @turn.save

UPDATE `turns` SET `turns`.`motivo` = 'tery', `turns`.`updated_at` = '2022-12-09 13:30:34.701181' WHERE `turns`.`id` = 3
UPDATE `turns` SET `turns`.`fecha` = '2022-11-03', `turns`.`estado` = 'Pendiente', `turns`.`updated_at` = '2022-11-29 22:50:43.497297' WHERE `turns`.`id` = 1
---
    def update
        authorize! turn
        if turn.update(turn_params)
            redirect_to turns_path, notice: t(".updated")

DELETE FROM `turns` WHERE `turns`.`id` = 23
DELETE FROM `turns` WHERE `turns`.`id` = 1
---
    def destroy
        authorize! turn
        turn.destroy
        redirect_to turns_path, notice: t(".destroyed")

SELECT `turns`.* FROM `turns` WHERE `turns`.`id` = 23 LIMIT 1
---
    def turn
        @turn = Turn.find(params[:id])