app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
    def show
        @user = User.find_by(id: params[:id])

UPDATE `users` SET `users`.`email` = 'nuevo1@gmail.com', `users`.`password_digest` = '$2a$12$qLvRUNkDcmCdkoV6TWy3SOLACuktbIQLjWxWFxuuR28EKi/B7hBUK', `users`.`updated_at` = '2022-12-08 22:40:34.259691' WHERE `users`.`id` = 4
---
    def update
        if user.update(user_params)

SELECT `users`.* FROM `users` WHERE (nuevo@gmail.com) LIMIT 1
---
    def index
        @users = User.all

DELETE FROM `users` WHERE `users`.`id` = 1
---
    def destroy
        user.destroy

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def user
        @user = User.find(params[:id])